Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE.tmx
Source language: de_ch
Languages: en_gb

source: AbsolventInnen berichten
en_gb: Graduates report!

source: Der Studiengang BA Übersetzen hat seit Sommer 2014 einen neuen Namen: Bachelorstudiengang Angewandte Sprachen.
en_gb: The BA degree programme in Translation has a new name: the BA degree programme in Applied Languages.

source: Janna la Roi, Studiengang Bachelor Übersetzen, Vertiefung Multimodale Kommunikation
en_gb: Janna la Roi, Bachelor of Arts in Translation, specialisation in Multimodal Communication

source: Meine Faszination für Sprachen gab für mich den Ausschlag, das Studium an der ZHAW in Angriff zu nehmen.
en_gb: My fascination with languages clinched it for me and I enrolled at the ZHAW!

source: Ich schätze die Vielfältigkeit des Studiums:
en_gb: I really like the variety of the programme.

source: Neben der sprachlichen Ausbildung bietet das Studium auch Einblicke in andere Fachgebiete, und dank der Wahlmöglichkeiten in der Sprachkombination, der Vertiefung und der Wahlfächer konnte ich ein individuelles Profil zusammenstellen.
en_gb: Along with the linguistic training, my studies also give an insight into other fields, and thanks to the options in language combination, specialisation and electives, I could put together my own individual profile.

source: Multimodale Kommunikation habe ich gewählt, um meine Übersetzungskenntnisse zu erweitern.
en_gb: I chose Multimodal Communication to develop my translation skills.

source: Dank der Vertiefung gewinne ich aber auch interessante Eindrücke in Bereichen wie Untertiteln oder Respeaking.
en_gb: But in following this specialisation, I can also gain interesting impressions in areas such as sub-titling or re-speaking.

source: Diego Serrano, Studiengang Bachelor Übersetzen, Vertiefung Mehrsprachige Kommunikation
en_gb: Diego Serrano, Bachelor of Arts in Translation, specialisation in Multilingual Communication

source: Der Hauptgrund, weshalb ich mich für dieses Studium entschieden habe, waren die Sprachen.
en_gb: Languages were the main reason why I chose to study at the ZHAW.

source: Im Verlauf meines beruflichen Werdegangs habe ich festgestellt, dass sie der Schlüssel zum Erfolg sind.
en_gb: In the course of my career, I had seen that they are the key to success.

source: Sprachen bilden nicht zuletzt Brücken zu anderen Kulturen und öffnen viele Türen.
en_gb: Not least because they build bridges to other cultures and open many doors.

source: Profis in interkultureller Kommunikation haben nach meinem Ermessen ausgesprochen gute Berufschancen und sind aufgrund der multikulturellen Arbeitswelt längerfristig immer mehr gefragt.
en_gb: Intercultural communications professionals have, in my opinion, excellent career possibilities and are, because of the multicultural nature of the working world, more and more in demand.

source: Ich habe die Vertiefung Mehrsprachige Kommunikation gewählt.
en_gb: I chose to specialise in Multilingual Communication.

source: Die Kursinhalte mit den mündlichen Fächern, Managementkursen und den vielen Präsentationen ergänzten sehr gut mein bisheriges Wissen aus meinen vorherigen Berufsjahren als Kaufmännischer Angestellter.
en_gb: The programme, which includes oral work, management courses and many presentations, complemented the knowledge and experience that I had previously gained in the commercial world.

source: Larissa Minder, Absolventin Bachelor Übersetzen, Vertiefung Technikkommunikation
en_gb: Larissa Minder, Bachelor of Arts in Translation with a specialisation in Technical Communication

source: Die Kombination von Sprache und Technik in der Vertiefung Technikkommunikation ist genau das Richtige für mich.
en_gb: The combination of language and technology in the Technical Communication specialisation is just right for me!

source: In den Lehrveranstaltungen werden alle praxisrelevanten Bereiche behandelt. Ganz besonders schätze ich auch die Praxisnähe der Dozierenden.
en_gb: The course covers all of the areas relevant to practice, and what I also particularly value is the practical experience of the lecturers.

source: Sie sind durch die Arbeit im Berufsfeld ganz nahe am Puls der Zeit und können den Studierenden hautnah weitergeben, worauf es später im Berufsleben ankommt.
en_gb: Through their work in their own professional fields, they have their fingers on the pulse and know exactly what they should pass on to their students, what will be useful to them in their professional life afterwards.

source: Dank dem Studium kann ich in meinem Traumberuf arbeiten, und das bereits kurz nach Abschluss kompetent und produktiv.
en_gb: Thanks to following this course, I can work in my dream profession competently and productively, even directly after graduation.

source: Auslandsemester
en_gb: Semester abroad

source: Das IUED unterstützt seine Studierenden dabei, ein Semester im Ausland zu absolvieren, da sie bei dieser Gelegenheit interkulturelle Erfahrungen sammeln, ein internationales Netzwerk aufbauen sowie die Karrierechancen auf dem Arbeitsmarkt verbessern können.
en_gb: The IUED supports its students in their endeavours to spend one semester studying abroad, since this will give them an opportunity of accumulating experience of other cultures, of developing an international network of their own and of improving their subsequent career prospects.

source: Für Studierende am IUED ist es problemlos möglich, ein Auslandsemester zu absolvieren.
en_gb: Students at the IUED should not encounter any difficulty in arranging to spend one semester studying in another country.

source: Das IUED nimmt auch Studierende aus dem Ausland, sogenannte Incomings, auf.
en_gb: The IUED also welcomes students from abroad as so-called incoming students.

source: Im fünften Semester Ihres Studiums haben Sie die Möglichkeit, ein Auslandsemester zu absolvieren.
en_gb: During your fifth semester, you will have an opportunity of studying abroad.

source: Im Normalfall findet der Austausch im Rahmen eines internationalen Austauschprogramms statt.
en_gb: Usually, these semesters abroad are organised through an international exchange programme.

source: Dies wird von der Studiengangleitung sehr empfohlen, ist jedoch nicht obligatorisch.
en_gb: While the Programme Directors strongly recommend that students avail themselves of this opportunity, it is not compulsory.

source: Das Studium ist so aufgebaut, dass Sie im fünften Semester an eine Hochschule im Ausland gehen können.
en_gb: The curriculum is designed to allow you to spend your fifth semester studying at a university outside Switzerland.

source: Jedes Jahr nutzen rund zwei Drittel der Studierenden im fünften Semester die Möglichkeit eines Austauschsemesters.
en_gb: Each year, some two thirds of the students enrolled in this degree programme take the opportunity of spending their fifth semester studying abroad.

source: Studierende, die das fünfte Semester an der ZHAW verbringen, haben eine breite Auswahl an Kursen und können Veranstaltungen aus allen Vertiefungen besuchen.
en_gb: Students spending their fifth semester at the ZHAW have a wide range of courses to choose from and may attend sessions in any specialisation.

source: An diesen Partnerhochschulen können Bachelorstudierende des IUED Auslandsemester absolvieren.
en_gb: These are the Partner Institutions at which IUED students can attend exchange semesters:

source: Vorbereitung
en_gb: Preparation

source: Zur Vorbereitung empfehlen wir:
en_gb: We recommend the following preparatory material:

source: Markt+Technik (ISBN 978-3-8272-4703-2)
en_gb: Markt+Technik (ISBN 978-3-8272-4703-2) – in German.

source: Das Selbstlernangebot, das in eingeschränktem Umfang auch Gästen offen steht.
en_gb: This link will direct you to a self-teaching tutorial, parts of which are also available to guests to the ZHAW website.

source: Wer über eines der folgenden Zertifikate verfügt, kann vom IT-Test dispensiert werden, sofern der Erwerb des Zertifikats nicht weiter als zwei Jahre zurückliegt:
en_gb: Candidates who have been awarded one of the certificates listed below can be granted a dispensation from this test, provided their certificate was awarded no more than two years before the date of their application:

source: ECDL Advanced
en_gb: ECDL Advanced (in German only)

source: Informatik Anwender II SIZ
en_gb: Informatik Anwender II SIZ (in German only)

source: Fähigkeitszeugnis als Informatiker/Informatikerin
en_gb: Swiss Federal proficiency certificate in Information Technology (in German, „Fähigkeitszeugnis als Informatiker / Informatikerin“)

source: Fähigkeitszeugnis als Mediamatiker/Mediamatikerin
en_gb: Swiss Federal proficiency certificate in Media Technology (in German, „Fähigkeitszeugnis als Mediamatiker / Mediamatikerin“)

source: IT-Test für Bachelor
en_gb: IT test

source: Zusätzlich zu den Sprachprüfungen muss auch ein IT-Test abgelegt werden.
en_gb: In addition to the language tests, candidates must also sit an IT test.

source: Der IT-Test stellt sicher, dass Sie über genügende Kenntnisse verfügen, um mit der IT-Umgebung im Studium erfolgreich umgehen zu können.
en_gb: The purpose of the IT test is to ensure that you have sufficient knowledge to enable you to make effective use of the IT environment available to you during your studies.

source: Er hat diagnostische Funktion und ist nicht relevant für das Bestehen der Eignungsprüfung.
en_gb: This is a purely diagnostic test. Its results have no impact on whether or not you pass the aptitude test.

source: Bei Nichtbestehen steht ein Selbstlernangebot zur Verfügung, mit dem Sie sich auf eine Wiederholung des IT-Tests während des ersten Semesters vorbereiten können.
en_gb: If you do not pass the IT test, you will be provided with a range of self-study tools which you can use to prepare for a resit during your first semester.

source: Gegenstand des Tests sind Grundkenntnisse über Computer und die Anwendung von Office-Applikationen, im Wesentlichen:
en_gb: The test examines your basic knowledge of computers and your ability to use office applications. The key areas it covers are:

source: Textverarbeitung
en_gb: Word processing

source: Präsentation
en_gb: Presentations

source: Tabellen und Datenbanken
en_gb: Spreadsheets and databases

source: Der IT-Test ist als Multiple-Choice-Prüfung gestaltet und dauert 20 Minuten.
en_gb: The IT test consists of a number of multiple-choice questions. It lasts 20 minutes.

source: Er liegt nur in deutscher Version vor und wird ohne Hilfsmittel und von Hand geschrieben.
en_gb: This is a handwritten test which is conducted in German only. No reference material or other aids are permitted.

source: Für die Prüfung in der Grundsprache gibt es keine Dispensationsmöglichkeit.
en_gb: All candidates must sit a language test in their primary language. No dispensation from this requirement can be granted for any candidate.

source: Wer über ein anerkanntes Sprachzertifikat des Niveaus C2 verfügt, kann von der Eignungsprüfung in der betreffenden Fremdsprache dispensiert werden, sofern der Erwerb des Zertifikats nicht länger als zwei Jahre zurückliegt.
en_gb: Candidates with a recognised language certificate at level C2 in a foreign language can be granted a dispensation from the test in that language provided the certificate was awarded no more than two years before the date of their application. The following certificates qualify for dispensation:

source: Fremdsprache Deutsch
en_gb: German as a foreign language

source: Zentrale Oberstufenprüfung (Goethe-Institut München)
en_gb: Zentrale Oberstufenprüfung (Goethe-Institut, Munich)

source: Fremdsprache Englisch
en_gb: English as a foreign language

source: Fremdsprache Französisch
en_gb: French as a foreign language

source: Fremdsprache Italienisch
en_gb: Italian as a foreign language

source: Fremdsprache Spanisch
en_gb: Spanish as a foreign language

source: Die hier genannten Sprachdiplome stellen Minimalanforderungen dar.
en_gb: These language diplomas (and, where applicable, the required grades) are minimum requirements.

source: Eine Dispensation ermöglichen auch höher einzustufende Diplome (z. B. Certificate of Proficiency in English).
en_gb: Dispensations can also be granted on the basis of higher qualifications (such as a Certificate of Proficiency in English).

source: Zur Prüfungsvorbereitung empfehlen wir Sprachaufenthalte in Kombination mit Sprachkursen, Praktika und/oder Arbeit in den entsprechenden Sprachregionen.
en_gb: We recommend that candidates prepare for the test by spending time in the countries where the relevant languages are spoken, and that they combine with this with language courses, internships and/or other work in the relevant linguistic regions.

source: Auf den folgenden Infoblättern finden Sie von uns empfohlene Literatur zur Vorbereitung auf die Sprachprüfungen.
en_gb: The information sheets below list the literature we recommend that candidates read to help them prepare for the language tests.

source: Infoblatt Grundsprachen (PDF, 97 KB)
en_gb: Information sheet on primary languages (PDF, 97 KB) (in German only)

source: Infoblatt Fremdsprachen (PDF, 112 KB)
en_gb: Information sheet on foreign languages (PDF, 112 KB) (in German only)

source: Mit den Demoversionen der Sprachprüfungen können Sie Ihr Niveau in den verschiedenen Sprachen besser einschätzen.
en_gb: The demo versions of the language tests will help you to gain a better appreciation of your current standard.

source: Sie geben eine Orientierung über die Inhalte und den Schwierigkeitsgrad der Eignungsprüfung, entsprechen aber insbesondere in ihrem Umfang nicht dem Original.
en_gb: While they provide an indication of the content of the aptitude test and its level of difficulty, they are not fully comparable with the test itself, particularly with regard to their length.

source: Bestehensbedingungen und Sprachbelegung
en_gb: Passing grades and language combinations

source: Die Eignungsprüfung ist bestanden, wenn jede einzelne Sprachprüfung bestanden ist.
en_gb: In order to pass their aptitude test, candidates must pass each of the language tests it comprises.

source: Eine Sprachprüfung ist bestanden, wenn ca. 60% der Punkte erreicht werden.
en_gb: To pass a language test they will need to provide correct answers to questions representing approximately 60% of the total possible point score.

source: In der Regel wird die Sprachbelegung im Studium gemäss dem Wunsch auf dem Anmeldeformular vorgenommen.
en_gb: As a rule, students passing the aptitude test will study the combination of languages they entered on their application form.

source: Wenn eine Sprache nur knapp bestanden ist, kann die Sprachbelegung gemäss den Resultaten der Eignungsprüfung vorgenommen werden (stärkere Fremdsprache = erste Fremdsprache, schwächere Fremdsprache = zweite Fremdsprache).
en_gb: When the grade achieved in a language examination is only just sufficient, the candidate’s language combination may be determined on the basis of his aptitude test results (with the stronger foreign language being the first foreign language and the weaker foreign language the second one).

source: Eine nicht bestandene Sprachprüfung kann ein Mal wiederholt werden, frühestens ein Jahr nach dem ersten Versuch.
en_gb: A candidate who does not pass the aptitude test at the first sitting may resit the test one more time, the resit being no earlier than one year after the first attempt.

source: Eignungsprüfung
en_gb: Aptitude test

source: Die Eignungsprüfung besteht aus Sprachprüfungen, die in der Grundsprache (Muttersprache) und mindestens zwei Fremdsprachen abgelegt werden.
en_gb: The aptitude test comprises a number of language tests in the candidate’s primary language (mother tongue) and at least two foreign languages.

source: Es können auch mehr Sprachprüfungen abgelegt werden, als im Grundstudium Sprachen belegt werden können.
en_gb: Candidates may take tests in a greater number of languages than it would be possible for them to cover in the their foundation course.

source: Das Eintrittsniveau entspricht in der Grundsprache einem überdurchschnittlichen Maturitätsniveau und in den Fremdsprachen etwa dem Niveau C1 gemäss Europäischem Referenzrahmen.
en_gb: The level of proficiency candidates will be expected to achieve for admission is equivalent to an above-average baccalaureate grade in their primary language and a level of approximately C1 under the Common European Reference Framework in their foreign languages.

source: Die Sprachprüfungen sind als Multiple-Choice-Prüfungen gestaltet und dauern in jeder Sprache 120 Minuten (exkl. 30 Minuten Pause).
en_gb: The tests for each language are multiple-choice tests, each lasting 120 minutes.

source: Sie werden ohne Hilfsmittel von Hand geschrieben.
en_gb: Candidates are required to complete the test by hand, without access to any reference material or other aids.

source: Weitere Informationen zu den Inhalten der Eignungsprüfung finden Sie unter Vorbereitung.
en_gb: You will find further information on the content of the aptitude test under Preparation.

source: Das Bestehen der Eignungsprüfung berechtigt zum Eintritt in den Studiengang im Jahr der Eignungsprüfung und in den darauffolgenden zwei Jahren.
en_gb: Candidates successfully completing the aptitude test are entitled to enrol in the bachelor degree programme in Translation in the year they take the test or in either of the two years thereafter.

source: Personen mit ausländischem Schulabschluss
en_gb: Candidates with secondary education qualifications from other countries

source: Das Anmeldeverfahren verläuft für ausländische StudienbewerberInnen gleich wie für BewerberInnen aus der Schweiz.
en_gb: The enrolment process for foreign candidates is the same as that for candidates from Switzerland.

source: Als Hilfestellung empfehlen wir ausländischen BewerberInnen jedoch vor der Anmeldung zur Eignungsprüfung, ihren Lebenslauf und eine Kopie ihres Studienberechtigungsausweises bei uns einzureichen.
en_gb: We would however advise candidates from outside Switzerland to provide us with a curriculum vitae and a copy of their secondary school diploma qualifying them to commence tertiary education.

source: Die Anmeldekosten sind für BewerberInnen aus dem Ausland die gleichen wie für SchweizerInnen.
en_gb: Enrolment costs for candidates from outside Switzerland are the same as those applicable to Swiss candidates.

source: Die Studiengebühren können allenfalls höher ausfallen.
en_gb: The course fees payable by students from outside Switzerland may be higher, however.

source: Eine Kostenübersicht findet sich hier.
en_gb: An overview of the costs involved can be found here (in German only ).

source: Es gibt keine Platzbeschränkung für ausländische Studierende.
en_gb: No specific quotas are applicable to students from other countries.

source: Zum Studium werden Sie zugelassen, wenn Sie die folgenden Bedingungen erfüllen:
en_gb: To be admitted for enrolment in this programme, you will need to fulfill the following requirements:

source: Maturitätszeugnis (gymnasiale Maturität, Fachmaturität, Berufsmaturität bzw. ein ausländisches Äquivalent)
en_gb: Present either a baccalaureate diploma - which may be either a Swiss general baccalaureate (in German, "gymnasiale Maturität"), a Swiss specialist baccalaureate (in German, "Fachmaturität"), a Swiss vocational baccalaureate (in German, "Berufsmaturität") or an equivalent qualification from another country.

source: Bestehen der Eignungsprüfung
en_gb: Pass the aptitude test

source: Ablegen des IT-Tests
en_gb: Complete an IT test

source: Der Nachweis berufspraktischer Erfahrung (Praxisjahr) ist keine Zulassungsbedingung für den Bachelorstudiengang Angewandte Sprachen. Empfohlen sind jedoch Sprachaufenthalte im Ausland vor Studienbeginn.
en_gb: While candidates for enrolment in the BA programme in Applied Languages are not required to demonstrate practical professional experience (e.g. a year of work experience), attendance at language courses abroad prior to the commencement of the programme is recommended.

source: Demoversionen der Sprachprüfungen
en_gb: Demo versions of language tests

source: Informationen zum Aufnahmeverfahren 2016
en_gb: Information on admissions procedure 2016

source: Anmeldeformular 2016
en_gb: Application form for 2016

source: Info-Veranstaltungen
en_gb: Information events

source: Studienstruktur
en_gb: Curriculum structure

source: Der Bachelorstudiengang Angewandte Sprachen ist als Vollzeitstudium angelegt, kann aber auch in Teilzeit (PDF, 192 KB) absolviert werden.
en_gb: Though structured as a full-time course, the BA programme in Applied Languages can also be completed by students attending on a part-time basis (PDF, 192 KB) (in German only).

source: Die Regelstudienzeit beträgt sechs Semester.
en_gb: For students attending on a full-time basis, the regular curriculum lasts six semesters.

source: Das erste Jahr (Assessmentstufe) ist für alle Studierenden gleich.
en_gb: The first-year curriculum (the assessment level) is the same for all students.

source: Das Hauptstudium gliedert sich in Kernstudium und Vertiefung.
en_gb: The main course of study comprises a core curriculum and the student’s individual specialisation.

source: Die Inhalte des Kernstudiums sind für alle Studierenden dieselben. Mit der Vertiefung wird ein thematischer Schwerpunkt in Mehrsprachiger Kommunikation, Multimodaler Kommunikation oder Technikkommunikation gelegt.
en_gb: The core curriculum is the same for all students, while the specialisations focus on Multilingual Communication, Multimodal Communication or Technical Communication.

source: Im fünften Semester besteht die Möglichkeit, im Rahmen eines Auslandsemesters an einer der zahlreichen Partnerhochschulen des IUED zu studieren.
en_gb: During their fifth semester, students have the opportunity of studying abroad at one of the IUED’s numerous partner universities.

source: Semesterstruktur und Zeitaufwand
en_gb: Semester structure and time required to complete curriculum

source: Ein Semester besteht aus 14 Wochen Unterrichtszeit, zwei Prüfungsvorbereitungswochen und zwei Prüfungswochen.
en_gb: Each semester comprises 14 weeks of teaching, two weeks of examination preparation and two weeks of examinations.

source: Das Herbstsemester startet jeweils in der Kalenderwoche 38, das Frühlingssemester in Kalenderwoche 8.
en_gb: Each academic year, the autumn semester starts in calendar week 38 and the spring semester starts in calendar week 8.

source: Studienbeginn ist jeweils nur im Herbst.
en_gb: Students always commence their studies in the autumn semester, at the beginning of the academic year.

source: Die Zeit zwischen Prüfungswochen und Semesterbeginn ist unterrichtsfrei. In dieser Zeit haben die Studierenden in der Regel keine Studienleistungen zu erbringen.
en_gb: Students have no classes or lectures to attend during the examination-preparation and examination weeks, and they are generally not expected to carry out any study assignments during that time.

source: Studienführer
en_gb: Prospectus

source: Im Studienführer finden Sie u.a. die Kursübersichten der einzelnen Semester.
en_gb: It contains an overview of courses in the individual semesters.

source: Berufliche Perspektiven
en_gb: Career prospects

source: Die Berufsmöglichkeiten mit dem Bachelor Angewandte Sprachen sind vielfältig.
en_gb: The career prospects available to graduates of the BA in Applied Languages are multifaceted.
